Revit 2026 API

# LabelUtilsGetLabelFor(BuiltInParameter) Method

---

Gets the user-visible name for a BuiltInParameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelFor(
	BuiltInParameter builtInParam
)
```
```vb
Public Shared Function GetLabelFor (
	builtInParam As BuiltInParameter
) As String
```
```cpp
public:
static String^ GetLabelFor(
	BuiltInParameter builtInParam
)
```
```fsharp
static member GetLabelFor :
        builtInParam : BuiltInParameter -> string
```

#### Parameters

builtInParam BuiltInParameter
     The BuiltInParameter to get the user-visible name.

#### Return Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the BuiltInParameter cannot be found. |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

GetLabelFor Overload

Autodesk.Revit.DB Namespace